[
    {
        "date": "08/24/2020",
        "post": "Forest bathing in nature has been such a reminder of when I was a kid on the farm exploring in nature. But growing up I was skinny kid lol! and got cold so easily in winter time or even on colder days and evenings through-out the year in Iowa. I developed a dislike even a fear for the cold and preferred the warmth of a hot shower or bath & warm places. \nMy health has always been so important to me through the years. The benefits of just being in nature, then learning about strength training and cardio. Yoga, meditation and breathing exercises. Nutritional changes along the way shifting to organic, then paleo, reduced sugar and finally pescatarian (eating only fish for meat) and the rest veggies, lentils, nuts and seeds. Then as I got older I noticed it took me longer to recover from my workouts or long hikes or physical soreness from my work. I read about cold therapy and started to finish my showers with cold. Then took my first cold bath. I did this in the year 2018 on and off. \nIn the winter of 2019/2020 I traveled to Thailand. On the island of Ko Phangan I taught yoga for 2 weeks, biked and hiked the island. I visited the beaches for sunsets. And did my first cold training workshop sitting in cold ice bath for 3 minutes. The fears that came up for me in my mind before and getting in were so big! But I also knew the benefits I read about and knowing my body, breath and that I could do this. The first minute was the hardest but like many things in life, I adapted. And then I entered what I called the “calm zone.” Breathing before and during helps so much. \nHaving  a teacher/guide is very helpful + other people that were joining me in this workshop. It raised my energy level, I didn’t feel sore anymore and my mind was so much more relaxed. \nIt was a life-changing event for sure! And I knew I wanted to share this with others & to do it in Nature :)",
        "photos": ["./Cold-Blog/photo0.jpg", "./Cold-Blog/photo1.jpg", "./Cold-Blog/photo2.jpg", "./Cold-Blog/photo3.jpg", "./Cold-Blog/photo4.jpg"]
    }
]