[
    {
        "date": "09/11/2020",
        "post": "Thailand is known as the country of smiles. Its history thousands of years old with a buddhist philosophy grounded in the culture with kids learning about meditation/mindfulness in the schools and temples, and today still a kingdom with a king and queen. \nThere are jungles, mountains, oceans, coconut trees with the sweetest coconut water found anywhere in the world! Thailand has been my number #1 place to visit in Asia and finally traveled to in 2019/2020 for 2 months. Visiting the island Ko Samui and Ko Phangan (both in the bay of Thailand) before flying to Chiang Mai in the north. I walked the beaches barefoot, swam in the ocean and saw the most beautiful sunsets I’ve ever seen! Going to day markets, night markets…and getting 5 massages during my visit :) \nThe food is “out of this world” good! Coconut soup, pad thai, curry’s, red snapper fish, sau-téed morning glory greens and coconut ice cream. I drank coconut water daily (fresh from real coconuts), learned to ride a scooter on the islands ( be sure to have international license and a good teacher to learn for safe-ty) as it is dangerous but very fun and great way to see the sights. I  rent-ed a bicycle to get around for cheap + a good workout for the legs. Going to outdoor gyms to lift weights + taking a muay thai boxing class (last kick breaking my left big toe) ouch!…but worth it :)  \nI stayed  in bungalows, ho-tels, yoga retreat center, thatch huts, volunteering at yoga school, and staying at hostel in Chiang Mai. The friendliest police I’ve meet and even they would smile at me as occasionally they would car/bike checks on the road. \nThe temples (called Wats) all over the country beautiful and magestic to the eyes. Many free to enter and Buddhist monks honored from the past and present. \nArtisans by the thousands…buying cats carved out of mango tree, thai buddha sculptured from resin, paper-cotton ball lights and hundreds of shops with statues, paintings, crafts and more. \nHospitality is the main word I think of when Thailand is mentioned. Enjoying life, taking time off to relax, let go of stress, and heal. \nThere are people of “good and bad” intentions/actions anywhere you travel to in the world but I felt the most safe in Thailand. Bring sunscreen, bug repellent and an open mind + heart and you will have an adventure of a lifetime. Click link below to see full list of what to bring :)",
        "photos": []
    }
]